export default function Home() {
  return (
    <div className="min-h-screen flex items-center justify-center bg-base-200">
      <div className="card bg-base-100 w-96 shadow-xl">
        <div className="card-body items-center text-center">
          <img src="/cute.gif" alt="Cute GIF" className="w-32 h-32 mx-auto" />
          
          <div className="font-bold text-xl">
            <h2>ความในใจจากดาด้าถึงพี่ไนท์ 🐶</h2>
          </div>
          
          <hr className="border-t border-gray-400 w-full my-4" />
          
          <p>
            อัลโหลนะไน้เข้ามาอ่านรึยังนะ นี่ดาด้าเอง
            <br />
            ดาด้าอยู่นี่แล้วก็ดาด้าอยากขอโทษก่อนอันดับแรกสำหรับเรื่องที่ผ่านมาดาด้ายังทำใจยอมรับตัวเองไม่ได้เลยที่ดาด้าทำไมมันหนักกับนะไน้จริงๆ
            แต่ดาด้าอยากจะขอโอกาสนะไน้อีกครั้งให้ดาด้ากลับไปอยู่กับนะไน้เหมือนเดิมได้มั้ย
            ดาด้าอยากอยู่กับนะไน้ไปตลอดใช้เวลาร่วมกันเหมือนเดิมทำอะไรด้วยกันเหมือนเดิม
            แล้วก็อยากให้นะไน้ทำมาม่าให้หม่ำเหมือนเดิมด้วย
            ดาด้าจะพยายามทำให้เราสองคนกลับมาเป็นเหมือนเดิมดาด้าสัญญาว่าจะวางแผนอนาคตร่วมกันกับนะไน้ทำให้นะไน้เชื่อใจว่าดาด้าจะมีแค่นะไน้แค่คนเดียว
            วันนี้วันวาเลนไทน์แหละดาด้าตั้งใจทำมาให้นะไน้เลยดาด้าอยากมาง้อและชอโทษกับสิ่งที่ดาด้าทำลงไปด้วยสุขสันต์วันวาเลนไทน์นะนะไน้คนเก่งของ
            มีมี่มูมู่กูกู้กีกี้ชาไทยนมสดและพี่ต่าย🌻🤍
          </p>

          <div className="card-actions">
            <button className="btn btn-primary text-white"><a href="/roadmap">ไดอารี่ 💌</a></button>
            <button className="btn btn-primary text-white"><a href="/dada_nanight">คลังรูปภาพ 💌</a></button>
          </div>
        </div>
      </div>
    </div>
  );
}
